micropython/micropython/ports/wch/bsp/src/ch32v30x_can.c
        CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
            ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh) << 16) |
            (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);

        CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
            ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
            (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow);
    }

    if (CAN_FilterInitStruct->CAN_FilterMode == CAN_FilterMode_IdMask) {
        CAN1->FMCFGR &= ~(uint32_t)filter_number_bit_pos;
    } else {
        CAN1->FMCFGR |= (uint32_t)filter_number_bit_pos;
    }

    if (CAN_FilterInitStruct->CAN_FilterFIFOAssignment == CAN_Filter_FIFO0) {
        CAN1->FAFIFOR &= ~(uint32_t)filter_number_bit_pos;
    }

    if (CAN_FilterInitStruct->CAN_FilterFIFOAssignment == CAN_Filter_FIFO1) {
        CAN1->FAFIFOR |= (uint32_t)filter_number_bit_pos;
    }

    if (CAN_FilterInitStruct->CAN_FilterActivation == ENABLE) {
        CAN1->FWR |= filter_number_bit_pos;
    }

    CAN1->FCTLR &= ~FCTLR_FINIT;
}

/*********************************************************************
 * @fn      CAN_StructInit
 *
 * @brief   Fills each CAN_InitStruct member with its default value.
 *
 * @param   CAN_InitStruct - pointer to a CAN_InitTypeDef structure which
 *        will be initialized.
 *
 * @return  none
 */
void CAN_StructInit(CAN_InitTypeDef *CAN_InitStruct) {
    CAN_InitStruct->CAN_TTCM = DISABLE;
    CAN_InitStruct->CAN_ABOM = DISABLE;
    CAN_InitStruct->CAN_AWUM = DISABLE;
    CAN_InitStruct->CAN_NART = DISABLE;
    CAN_InitStruct->CAN_RFLM = DISABLE;
    CAN_InitStruct->CAN_TXFP = DISABLE;
    CAN_InitStruct->CAN_Mode = CAN_Mode_Normal;
    CAN_InitStruct->CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct->CAN_BS1 = CAN_BS1_4tq;
    CAN_InitStruct->CAN_BS2 = CAN_BS2_3tq;
    CAN_InitStruct->CAN_Prescaler = 1;
}

/*********************************************************************
 * @fn      CAN_SlaveStartBank
 *
 * @brief   This function applies only to CH32 Connectivity line devices.
 *
 * @param   CAN_BankNumber - Select the start slave bank filter from 1..27.
 *
 * @return  none
 */
void CAN_SlaveStartBank(uint8_t CAN_BankNumber) {
    CAN1->FCTLR |= FCTLR_FINIT;
    CAN1->FCTLR &= (uint32_t)0xFFFFC0F1;
    CAN1->FCTLR |= (uint32_t)(CAN_BankNumber) << 8;
    CAN1->FCTLR &= ~FCTLR_FINIT;
}

/*********************************************************************
 * @fn      CAN_DBGFreeze
 *
 * @brief   Enables or disables the DBG Freeze for CAN.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void CAN_DBGFreeze(CAN_TypeDef *CANx, FunctionalState NewState) {
    if (NewState != DISABLE) {
        CANx->CTLR |= CTLR_DBF;
    } else {
        CANx->CTLR &= ~CTLR_DBF;
    }
}

/*********************************************************************
 * @fn      CAN_TTComModeCmd
 *
 * @brief   Enables or disabes the CAN Time TriggerOperation communication mode.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void CAN_TTComModeCmd(CAN_TypeDef *CANx, FunctionalState NewState) {
    if (NewState != DISABLE) {
        CANx->CTLR |= CAN_CTLR_TTCM;

        CANx->sTxMailBox[0].TXMDTR |= ((uint32_t)CAN_TXMDT0R_TGT);
        CANx->sTxMailBox[1].TXMDTR |= ((uint32_t)CAN_TXMDT1R_TGT);
        CANx->sTxMailBox[2].TXMDTR |= ((uint32_t)CAN_TXMDT2R_TGT);
    } else {
        CANx->CTLR &= (uint32_t)(~(uint32_t)CAN_CTLR_TTCM);

        CANx->sTxMailBox[0].TXMDTR &= ((uint32_t) ~CAN_TXMDT0R_TGT);
        CANx->sTxMailBox[1].TXMDTR &= ((uint32_t) ~CAN_TXMDT1R_TGT);
        CANx->sTxMailBox[2].TXMDTR &= ((uint32_t) ~CAN_TXMDT2R_TGT);
    }
}

/*********************************************************************
 * @fn      CAN_Transmit
 *
 * @brief   Initiates the transmission of a message.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          TxMessage - pointer to a structure which contains CAN Id, CAN
 *        DLC and CAN data.
 *
 * @return  transmit_mailbox - The number of the mailbox that is used for
 *        transmission or CAN_TxStatus_NoMailBox if there is no empty mailbox.
 */
uint8_t CAN_Transmit(CAN_TypeDef *CANx, CanTxMsg *TxMessage) {
    uint8_t transmit_mailbox = 0;

    if ((CANx->TSTATR & CAN_TSTATR_TME0) == CAN_TSTATR_TME0) {
        transmit_mailbox = 0;
    } else if ((CANx->TSTATR & CAN_TSTATR_TME1) == CAN_TSTATR_TME1) {
        transmit_mailbox = 1;
    } else if ((CANx->TSTATR & CAN_TSTATR_TME2) == CAN_TSTATR_TME2) {
        transmit_mailbox = 2;
    } else {
        transmit_mailbox = CAN_TxStatus_NoMailBox;
    }

    if (transmit_mailbox != CAN_TxStatus_NoMailBox) {
        CANx->sTxMailBox[transmit_mailbox].TXMIR &= TMIDxR_TXRQ;
        if (TxMessage->IDE == CAN_Id_Standard) {
            CANx->sTxMailBox[transmit_mailbox].TXMIR |= ((TxMessage->StdId << 21) |
                TxMessage->RTR);
        } else {
            CANx->sTxMailBox[transmit_mailbox].TXMIR |= ((TxMessage->ExtId << 3) |
                TxMessage->IDE |
                TxMessage->RTR);
        }

        TxMessage->DLC &= (uint8_t)0x0000000F;
        CANx->sTxMailBox[transmit_mailbox].TXMDTR &= (uint32_t)0xFFFFFFF0;
        CANx->sTxMailBox[transmit_mailbox].TXMDTR |= TxMessage->DLC;

        CANx->sTxMailBox[transmit_mailbox].TXMDLR = (((uint32_t)TxMessage->Data[3] << 24) |
            ((uint32_t)TxMessage->Data[2] << 16) |
            ((uint32_t)TxMessage->Data[1] << 8) |
            ((uint32_t)TxMessage->Data[0]));
        CANx->sTxMailBox[transmit_mailbox].TXMDHR = (((uint32_t)TxMessage->Data[7] << 24) |
            ((uint32_t)TxMessage->Data[6] << 16) |
            ((uint32_t)TxMessage->Data[5] << 8) |
            ((uint32_t)TxMessage->Data[4]));
        CANx->sTxMailBox[transmit_mailbox].TXMIR |= TMIDxR_TXRQ;
    }

    return transmit_mailbox;
}

/*********************************************************************
 * @fn      CAN_TransmitStatus
 *
 * @brief   Checks the transmission of a message.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          TransmitMailbox - the number of the mailbox that is used for
 *        transmission.
 *
 * @return  state -
 *            CAN_TxStatus_Ok.
 *            CAN_TxStatus_Failed.
 */
uint8_t CAN_TransmitStatus(CAN_TypeDef *CANx, uint8_t TransmitMailbox) {
    uint32_t state = 0;

    switch (TransmitMailbox)
    {
        case (CAN_TXMAILBOX_0):
            state = CANx->TSTATR & (CAN_TSTATR_RQCP0 | CAN_TSTATR_TXOK0 | CAN_TSTATR_TME0);
            break;

        case (CAN_TXMAILBOX_1):
            state = CANx->TSTATR & (CAN_TSTATR_RQCP1 | CAN_TSTATR_TXOK1 | CAN_TSTATR_TME1);
            break;

