micropython/micropython/ports/wch/bsp/src/ch32v30x_can.c
        case (CAN_TXMAILBOX_2):
            state = CANx->TSTATR & (CAN_TSTATR_RQCP2 | CAN_TSTATR_TXOK2 | CAN_TSTATR_TME2);
            break;

        default:
            state = CAN_TxStatus_Failed;
            break;
    }

    switch (state)
    {
        case (0x0):
            state = CAN_TxStatus_Pending;
            break;

        case (CAN_TSTATR_RQCP0 | CAN_TSTATR_TME0):
            state = CAN_TxStatus_Failed;
            break;

        case (CAN_TSTATR_RQCP1 | CAN_TSTATR_TME1):
            state = CAN_TxStatus_Failed;
            break;

        case (CAN_TSTATR_RQCP2 | CAN_TSTATR_TME2):
            state = CAN_TxStatus_Failed;
            break;

        case (CAN_TSTATR_RQCP0 | CAN_TSTATR_TXOK0 | CAN_TSTATR_TME0):
            state = CAN_TxStatus_Ok;
            break;

        case (CAN_TSTATR_RQCP1 | CAN_TSTATR_TXOK1 | CAN_TSTATR_TME1):
            state = CAN_TxStatus_Ok;
            break;

        case (CAN_TSTATR_RQCP2 | CAN_TSTATR_TXOK2 | CAN_TSTATR_TME2):
            state = CAN_TxStatus_Ok;
            break;

        default:
            state = CAN_TxStatus_Failed;
            break;
    }

    return (uint8_t)state;
}

/*********************************************************************
 * @fn      CAN_CancelTransmit
 *
 * @brief   Cancels a transmit request.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          Mailbox -  Mailbox number.
 *            CAN_TXMAILBOX_0.
 *            CAN_TXMAILBOX_1.
 *            CAN_TXMAILBOX_2.
 *
 * @return  none
 */
void CAN_CancelTransmit(CAN_TypeDef *CANx, uint8_t Mailbox) {
    switch (Mailbox)
    {
        case (CAN_TXMAILBOX_0):
            CANx->TSTATR |= CAN_TSTATR_ABRQ0;
            break;

        case (CAN_TXMAILBOX_1):
            CANx->TSTATR |= CAN_TSTATR_ABRQ1;
            break;

        case (CAN_TXMAILBOX_2):
            CANx->TSTATR |= CAN_TSTATR_ABRQ2;
            break;

        default:
            break;
    }
}

/*********************************************************************
 * @fn      CAN_Receive
 *
 * @brief   Receives a message.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *            CAN_FIFO1.
 *          RxMessage -  pointer to a structure receive message which contains
 *        CAN Id, CAN DLC, CAN datas and FMI number.
 *
 * @return  none
 */
void CAN_Receive(CAN_TypeDef *CANx, uint8_t FIFONumber, CanRxMsg *RxMessage) {
    RxMessage->IDE = (uint8_t)0x04 & CANx->sFIFOMailBox[FIFONumber].RXMIR;

    if (RxMessage->IDE == CAN_Id_Standard) {
        RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 21);
    } else {
        RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 3);
    }

    RxMessage->RTR = (uint8_t)0x02 & CANx->sFIFOMailBox[FIFONumber].RXMIR;
    RxMessage->DLC = (uint8_t)0x0F & CANx->sFIFOMailBox[FIFONumber].RXMDTR;
    RxMessage->FMI = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDTR >> 8);
    RxMessage->Data[0] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RXMDLR;
    RxMessage->Data[1] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 8);
    RxMessage->Data[2] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 16);
    RxMessage->Data[3] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 24);
    RxMessage->Data[4] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RXMDHR;
    RxMessage->Data[5] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 8);
    RxMessage->Data[6] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 16);
    RxMessage->Data[7] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 24);

    if (FIFONumber == CAN_FIFO0) {
        CANx->RFIFO0 |= CAN_RFIFO0_RFOM0;
    } else {
        CANx->RFIFO1 |= CAN_RFIFO1_RFOM1;
    }
}

/*********************************************************************
 * @fn      CAN_FIFORelease
 *
 * @brief   Releases the specified FIFO.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *            CAN_FIFO1.
 *
 * @return  none
 */
void CAN_FIFORelease(CAN_TypeDef *CANx, uint8_t FIFONumber) {
    if (FIFONumber == CAN_FIFO0) {
        CANx->RFIFO0 |= CAN_RFIFO0_RFOM0;
    } else {
        CANx->RFIFO1 |= CAN_RFIFO1_RFOM1;
    }
}

/*********************************************************************
 * @fn      CAN_MessagePending
 *
 * @brief   Returns the number of pending messages.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *            CAN_FIFO1.
 *
 * @return  message_pending: which is the number of pending message.
 */
uint8_t CAN_MessagePending(CAN_TypeDef *CANx, uint8_t FIFONumber) {
    uint8_t message_pending = 0;

    if (FIFONumber == CAN_FIFO0) {
        message_pending = (uint8_t)(CANx->RFIFO0 & (uint32_t)0x03);
    } else if (FIFONumber == CAN_FIFO1) {
        message_pending = (uint8_t)(CANx->RFIFO1 & (uint32_t)0x03);
    } else {
        message_pending = 0;
    }

    return message_pending;
}

/*********************************************************************
 * @fn      CAN_OperatingModeRequest
 *
 * @brief   Select the CAN Operation mode.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_OperatingMode - CAN Operating Mode.
 *            CAN_OperatingMode_Initialization.
 *            CAN_OperatingMode_Normal.
 *            CAN_OperatingMode_Sleep.
 *
 * @return  status -
 *          CAN_ModeStatus_Failed - CAN failed entering the specific mode.
 *          CAN_ModeStatus_Success - CAN Succeed entering the specific mode.
 */
uint8_t CAN_OperatingModeRequest(CAN_TypeDef *CANx, uint8_t CAN_OperatingMode) {
    uint8_t status = CAN_ModeStatus_Failed;
    uint32_t timeout = INAK_TIMEOUT;

    if (CAN_OperatingMode == CAN_OperatingMode_Initialization) {
        CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_SLEEP)) | CAN_CTLR_INRQ);

        while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK) && (timeout != 0)) {
            timeout--;
        }
        if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK) {
            status = CAN_ModeStatus_Failed;
        } else {
            status = CAN_ModeStatus_Success;
        }
    } else if (CAN_OperatingMode == CAN_OperatingMode_Normal) {
        CANx->CTLR &= (uint32_t)(~(CAN_CTLR_SLEEP | CAN_CTLR_INRQ));

        while (((CANx->STATR & CAN_MODE_MASK) != 0) && (timeout != 0)) {
            timeout--;
        }
        if ((CANx->STATR & CAN_MODE_MASK) != 0) {
            status = CAN_ModeStatus_Failed;
        } else {
            status = CAN_ModeStatus_Success;
        }
    } else if (CAN_OperatingMode == CAN_OperatingMode_Sleep) {
        CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);

        while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK) && (timeout != 0)) {
            timeout--;
        }
        if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK) {
            status = CAN_ModeStatus_Failed;
        } else {
            status = CAN_ModeStatus_Success;
        }
    } else {
        status = CAN_ModeStatus_Failed;
    }

